#Область ПрограммныйИнтерфейс

#Область ИнформационныеОтветы

// 100 Continue
// Промежуточный ответ, он указывает, что клиент должен продолжить запрос
// или игнорировать этот ответ, если запрос уже завершен.
//
// Возвращаемое значение:
//	Число - 100
//
Функция Continue_100() Экспорт
	Возврат 100;
КонецФункции

// 101 Switching Protocols
// Этот код отправляется в ответ на заголовок запроса Upgrade от клиента и указывает протокол,
// на который переключается сервер.
//
// Возвращаемое значение:
//	Число - 101
//
Функция SwitchingProtocols_101() Экспорт
	Возврат 101;
КонецФункции

// 102 Processing (WebDAV)
// Сервер получил и обрабатывает запрос, но ответа пока нет.
//
// Возвращаемое значение:
//	Число - 102
//
Функция Processing_102() Экспорт
	Возврат 102;
КонецФункции

// 103 Early Hints
// Этот код в первую очередь предназначен для использования с заголовком Link,
// позволяя пользовательскому агенту начать предварительную загрузку ресурсов
// или осуществить предварительное соединение к источнику ресурсов, пока сервер готовит ответ.
//
// Возвращаемое значение:
//	Число - 103
//
Функция EarlyHints_103() Экспорт
	Возврат 103;
КонецФункции

#КонецОбласти

#Область УспешныеОтветы

// 200 OK
// Запрос успешно выполнен. Значение результата «успех» зависит от метода HTTP:
// GET: Ресурс был получен и передан в теле сообщения.
// HEAD: Ответ содержит заголовки, но тела сообщения нет.
// PUT или POST: Ресурс, описывающий результат действия, передан в теле сообщения.
// TRACE: Тело сообщения содержит сообщение запроса, полученное сервером.
//
// Возвращаемое значение:
//	Число - 200
//
Функция OK_200() Экспорт
	Возврат 200;
КонецФункции

// 201 Created
// Запрос выполнен успешно, и в результате был создан новый ресурс.
// Обычно это ответ, отправляемый на запросы POST или PUT.
//
// Возвращаемое значение:
//	Число - 201
//
Функция Created_201() Экспорт
	Возврат 201;
КонецФункции

// 202 Accepted
// Запрос получен, но еще не обработан. Это «уклончивый» ответ,
// поскольку в HTTP нет возможности позже отправить асинхронный ответ с результатом обработки запроса.
// Этот код предназначен для случаев, когда запрос обрабатывается другим процессом или сервером,
// а также для пакетной обработки.
//
// Возвращаемое значение:
//	Число - 202
//
Функция Accepted_202() Экспорт
	Возврат 202;
КонецФункции

// 203 Non-Authoritative Information
// Возвращенные метаданные не полностью совпадают с теми, которые доступны на исходном сервере,
// а получены из другого источника. Чаще всего это используется для зеркал или резервных копий ресурсов.
// За исключением таких случаев предпочтительнее использовать ответ 200 OK.
//
// Возвращаемое значение:
//	Число - 203
//
Функция NonAuthoritativeInformation_203() Экспорт
	Возврат 203;
КонецФункции

// 204 No Content
// Для этого запроса нет содержимого для отправки, но заголовки ответа могут быть полезны.
// Пользовательский агент может использовать их для обновления закешированных заголовков,
// полученных ранее для этого ресурса.
//
// Возвращаемое значение:
//	Число - 204
//
Функция NoContent_204() Экспорт
	Возврат 204;
КонецФункции

// 205 Reset Content
// Сообщает пользовательскому агенту, что необходимо сбросить отображение документа, который отправил этот запрос.
//
// Возвращаемое значение:
//	Число - 205
//
Функция ResetContent_205() Экспорт
	Возврат 205;
КонецФункции

// 206 Partial Content
// Этот код ответа используется, когда от клиента отправляется заголовок Range для запроса только части ресурса.
//
// Возвращаемое значение:
//	Число - 206
//
Функция PartialContent_206() Экспорт
	Возврат 206;
КонецФункции

// 207 Multi-Status (WebDAV)
// Передает информацию о нескольких ресурсах в случаях, когда могут быть уместны несколько кодов состояния.
//
// Возвращаемое значение:
//	Число - 207
//
Функция MultiStatus_207() Экспорт
	Возврат 207;
КонецФункции

// 208 Already Reported (WebDAV)
// Используется внутри элемента ответа <dav:propstat>,
// чтобы избежать повторного перечисления «привязок» и дублирования данных.
//
// Возвращаемое значение:
//	Число - 208
//
Функция AlreadyReported_208() Экспорт
	Возврат 208;
КонецФункции

// 226 IM Used (HTTP Delta encoding)
// Используется для ответа на запросы GET в тех случаях,
// когда сервер хочет отправить только измененную часть ресурса (то есть «дельту»).
//
// Возвращаемое значение:
//	Число - 226
//
Функция IMUsed_226() Экспорт
	Возврат 226;
КонецФункции

#КонецОбласти

#Область СообщенияОПеренаправлении

// 300 Multiple Choices
// У запроса более одного возможного ответа. Пользовательский агент или пользователь должен выбрать один из них.
// Не существует стандартизированного способа выбора одного из ответов,
// но рекомендуется использовать HTML-ссылки на возможные варианты, чтобы у пользователя была возможность выбора.
//
// Возвращаемое значение:
//	Число - 300
//
Функция MultipleChoices_300() Экспорт
	Возврат 300;
КонецФункции

// 301 Moved Permanently
// URL-адрес запрошенного ресурса был изменен навсегда. Новый URL-адрес указан в ответе.
//
// Возвращаемое значение:
//	Число - 301
//
Функция MovedPermanently_301() Экспорт
	Возврат 301;
КонецФункции

// 302 Found
// URI запрошенного ресурса был временно изменен. В будущем могут быть внесены дальнейшие изменения в URI.
// Следовательно, этот же URI должен использоваться клиентом в будущих запросах.
//
// Возвращаемое значение:
//	Число - 302
//
Функция Found_302() Экспорт
	Возврат 302;
КонецФункции

// 303 See Other
// Клиенту необходимо получить запрошенный ресурс по другому URI с помощью запроса GET.
//
// Возвращаемое значение:
//	Число - 303
//
Функция SeeOther_303() Экспорт
	Возврат 303;
КонецФункции

// 304 Not Modified
// Этот код используется для целей кэширования. Он сообщает клиенту, что ответ не был изменен,
// поэтому клиент может продолжать использовать кэшированную версию ответа.
//
// Возвращаемое значение:
//	Число - 304
//
Функция NotModified_304() Экспорт
	Возврат 304;
КонецФункции

// 305 Use Proxy Устарело
// Запрошенный ответ должен быть доступен через прокси.
// Этот код определен в предыдущей версии спецификации HTTP и в настоящее время устарел из-за проблем безопасности,
// связанных с внутренней настройкой прокси-сервера.
//
// Возвращаемое значение:
//	Число - 305
//
Функция UseProxy_305() Экспорт
	Возврат 305;
КонецФункции

// 306 Unused
// Этот код ответа зарезервирован. Использовался в предыдущей версии спецификации HTTP/1.1.
//
// Возвращаемое значение:
//	Число - 306
//
Функция Unused_306() Экспорт
	Возврат 306;
КонецФункции

// 307 Temporary Redirect
// Клиенту необходимо получить запрошенный ресурс по другому URI тем же методом,
// который использовался в предыдущем запросе. Он имеет ту же семантику, что и код ответа 302 Found,
// за исключением того, что пользовательский агент не должен изменять используемый метод:
// если в первом запросе использовался POST, то POST должен использоваться и во втором запросе.
//
// Возвращаемое значение:
//	Число - 307
//
Функция TemporaryRedirect_307() Экспорт
	Возврат 307;
КонецФункции

// 308 Permanent Redirect
// Ресурс теперь находится по другому URI, указанному в заголовке ответа Location.
// Он имеет ту же семантику, что и код ответа 301 Moved Permanently,
// за исключением того, что пользовательский агент не должен изменять используемый метод:
// если в первом запросе использовался POST, то POST должен использоваться и во втором запросе.
//
// Возвращаемое значение:
//	Число - 308
//
Функция PermanentRedirect_308() Экспорт
	Возврат 308;
КонецФункции

#КонецОбласти

#Область ОшибкиКлиента

// 400 Bad Request
// Сервер не может или не будет обрабатывать запрос из-за чего-то, что воспринимается как ошибка клиента
// (например, неправильный синтаксис, формат или маршрутизация запроса).
//
// Возвращаемое значение:
//	Число - 400
//
Функция BadRequest_400() Экспорт
	Возврат 400;
КонецФункции

// 401 Unauthorized
// Хотя стандарт HTTP определяет этот ответ как «неавторизованный», семантически он означает «неаутентифицированный».
// Это значит, что клиент должен аутентифицировать себя, чтобы получить запрошенный ответ.
//
// Возвращаемое значение:
//	Число - 401
//
Функция Unauthorized_401() Экспорт
	Возврат 401;
КонецФункции

// 402 Payment Required Экспериментальная возможность
// Этот код ответа зарезервирован для использования в будущем.
// Первоначальной целью создания этого кода было использование его для цифровых платежных систем,
// однако он используется очень редко и стандартного соглашения не существует.
//
// Возвращаемое значение:
//	Число - 402
//
Функция PaymentRequired_402() Экспорт
	Возврат 402;
КонецФункции

// 403 Forbidden
// Клиент не имеет прав доступа к контенту, то есть он неавторизован,
// поэтому сервер отказывается предоставить запрошенный ресурс.
// В отличие от 401 Unauthorized, личность клиента известна серверу.
//
// Возвращаемое значение:
//	Число - 403
//
Функция Forbidden_403() Экспорт
	Возврат 403;
КонецФункции

// 404 Not Found
// Сервер не может найти запрошенный ресурс. В браузере это означает, что URL-адрес не распознан.
// В API это также может означать, что адрес правильный, но ресурс не существует.
// Сервер также может отправить этот код ответа вместо 403 Forbidden,
// чтобы скрыть существование ресурса от неавторизованного клиента.
// Это самый известный код ответа из-за его частого появления в сети.
//
// Возвращаемое значение:
//	Число - 404
//
Функция NotFound_404() Экспорт
	Возврат 404;
КонецФункции

// 405 Method Not Allowed
// Метод запроса известен серверу, но не поддерживается целевым ресурсом.
// Например, API может не разрешать вызов DELETE для удаления ресурса.
//
// Возвращаемое значение:
//	Число - 405
//
Функция MethodNotAllowed_405() Экспорт
	Возврат 405;
КонецФункции

// 406 Not Acceptable
// Сервер после выполнения согласования контента не нашел содержимого,
// соответствующего критериям, заданным пользовательским агентом.
//
// Возвращаемое значение:
//	Число - 406
//
Функция NotAcceptable_406() Экспорт
	Возврат 406;
КонецФункции

// 407 Proxy Authentication Required
// Этот код ответа похож на 401 Unauthorized, но аутентификация должна выполняться через прокси-сервер.
//
// Возвращаемое значение:
//	Число - 407
//
Функция ProxyAuthenticationRequired_407() Экспорт
	Возврат 407;
КонецФункции

// 408 Request Timeout
// Сервер может отправить этот код ответа при неиспользовании соединения,
// даже без предварительного запроса со стороны клиента. Он означает, что сервер хотел бы закрыть это соединение.
// Этот ответ используется сравнительно часто, поскольку некоторые браузеры (такие как Chrome, Firefox 27+ или IE9)
// для ускорения используют механизмы предварительного подключения HTTP.
// Некоторые серверы просто закрывают соединение, не отправляя это сообщение.
//
// Возвращаемое значение:
//	Число - 408
//
Функция RequestTimeout_408() Экспорт
	Возврат 408;
КонецФункции

// 409 Conflict
// Запрос конфликтует с текущим состоянием сервера.
//
// Возвращаемое значение:
//	Число - 409
//
Функция Conflict_409() Экспорт
	Возврат 409;
КонецФункции

// 410 Gone
// Запрошенное содержимое было удалено с сервера, и отсутствует возможность переадресации.
// Ожидается, что клиенты удалят свои кеши и ссылки на этот ресурс. Спецификация HTTP предполагает,
// что этот код ответа будет использоваться для «ограниченных по времени или рекламных услуг».
// API не обязаны указывать ресурсы, которые были удалены, с помощью этого кода.
//
// Возвращаемое значение:
//	Число - 410
//
Функция Gone_410() Экспорт
	Возврат 410;
КонецФункции

// 411 Length Required
// Запрос отклонен, потому что сервер требует указание поля заголовка Content-Length, но оно не определено.
//
// Возвращаемое значение:
//	Число - 411
//
Функция LengthRequired_411() Экспорт
	Возврат 411;
КонецФункции

// 412 Precondition Failed
// Клиент указал в заголовках запроса условия, которым сервер не соответствует.
//
// Возвращаемое значение:
//	Число - 412
//
Функция PreconditionFailed_412() Экспорт
	Возврат 412;
КонецФункции

// 413 Payload Too Large
// Размер объекта запроса превышает ограничения, определенные сервером.
// Сервер может закрыть соединение или вернуть поле заголовка Retry-After.
//
// Возвращаемое значение:
//	Число - 413
//
Функция PayloadTooLarge_413() Экспорт
	Возврат 413;
КонецФункции

// 414 URI Too Long
// Запрошенный клиентом URI слишком длинный для того, чтобы сервер смог его обработать.
//
// Возвращаемое значение:
//	Число - 414
//
Функция URITooLong_414() Экспорт
	Возврат 414;
КонецФункции

// 415 Unsupported Media Type
// Запрос отклонен, потому что медиа формат запрашиваемых данных не поддерживается сервером.
//
// Возвращаемое значение:
//	Число - 415
//
Функция UnsupportedMediaType_415() Экспорт
	Возврат 415;
КонецФункции

// 416 Range Not Satisfiable
// Сервер не может корректно обработать запрос с учетом диапазона, указанного в поле заголовка Range.
//
// Возвращаемое значение:
//	Число - 416
//
Функция RangeNotSatisfiable_416() Экспорт
	Возврат 416;
КонецФункции

// 417 Expectation Failed
// Сервер не может выполнить ожидание, указанное в поле заголовка запроса Expect.
//
// Возвращаемое значение:
//	Число - 417
//
Функция ExpectationFailed_417() Экспорт
	Возврат 417;
КонецФункции

// 418 I'm a teapot
// "Шуточный" ответ: сервер отклоняет попытку заварить кофе в чайнике.
//
// Возвращаемое значение:
//	Число - 418
//
Функция IMATeapot_418() Экспорт
	Возврат 418;
КонецФункции

// 421 Misdirected Request
// Сервер не может дать ответ. Возможно сервер не настроен для комбинации схемы и полномочий, указанных в URI запроса.
//
// Возвращаемое значение:
//	Число - 421
//
Функция MisdirectedRequest_421() Экспорт
	Возврат 421;
КонецФункции

// 422 Unprocessable Content (WebDAV)
// Запрос сформирован правильно, но его невозможно выполнить из-за семантических ошибок.
//
// Возвращаемое значение:
//	Число - 422
//
Функция UnprocessableContent_422() Экспорт
	Возврат 422;
КонецФункции

// 423 Locked (WebDAV)
// Запрашиваемый ресурс заблокирован.
//
// Возвращаемое значение:
//	Число - 423
//
Функция Locked_423() Экспорт
	Возврат 423;
КонецФункции

// 424 Failed Dependency (WebDAV)
// Запрос не выполнен из-за проблем в предыдущем запросе.
//
// Возвращаемое значение:
//	Число - 424
//
Функция FailedDependency_424() Экспорт
	Возврат 424;
КонецФункции

// 425 Too Early Экспериментальная возможность
// Клиент отправил порцию данных слишком рано, до того как сервер установил безопасное соединение.
//
// Возвращаемое значение:
//	Число - 425
//
Функция TooEarly_425() Экспорт
	Возврат 425;
КонецФункции

// 426 Upgrade Required
// Сервер отказывается выполнять запрос с использованием текущего протокола,
// но может быть готов сделать это после смены протокола на указанный в заголовке ответа Upgrade.
//
// Возвращаемое значение:
//	Число - 426
//
Функция UpgradeRequired_426() Экспорт
	Возврат 426;
КонецФункции

// 428 Precondition Required
// Сервер требует, чтобы запрос содержал условия.
// Этот ответ предназначен для предотвращения проблемы одновременного изменения ресурса несколькими пользователями.
//
// Возвращаемое значение:
//	Число - 428
//
Функция PreconditionRequired_428() Экспорт
	Возврат 428;
КонецФункции

// 429 Too Many Requests
// Пользователь отправил слишком много запросов в определенный промежуток времени.
//
// Возвращаемое значение:
//	Число - 429
//
Функция TooManyRequests_429() Экспорт
	Возврат 429;
КонецФункции

// 431 Request Header Fields Too Large
// Сервер не будет обрабатывать запрос, потому что поля заголовка слишком велики.
// Запрос может быть отправлен повторно после уменьшения размера полей заголовка.
//
// Возвращаемое значение:
//	Число - 431
//
Функция RequestHeaderFieldsTooLarge_431() Экспорт
	Возврат 431;
КонецФункции

// 451 Unavailable For Legal Reasons
// Пользовательский агент запросил ресурс, который не может быть предоставлен по закону,
// например веб-страницу, подвергнутую цензуре со стороны правительства.
//
// Возвращаемое значение:
//	Число - 451
//
Функция UnavailableForLegalReasons_451() Экспорт
	Возврат 451;
КонецФункции

#КонецОбласти

#Область ОшибкиСервера

// 500 Internal Server Error
// На сервере произошла ошибка, в результате которой он не может успешно обработать запрос.
//
// Возвращаемое значение:
//	Число - 500
//
Функция InternalServerError_500() Экспорт
	Возврат 500;
КонецФункции

// 501 Not Implemented
// Метод запроса не поддерживается сервером и поэтому он не может быть обработан.
// Методы GET и HEAD должны всегда поддерживаться сервером и для них не должен возвращаться этот код.
//
// Возвращаемое значение:
//	Число - 501
//
Функция NotImplemented_501() Экспорт
	Возврат 501;
КонецФункции

// 502 Bad Gateway
// Такой ответ может прислать сервер, который выступает в качестве шлюза,
// если в процессе обработки запроса он получил недопустимый ответ от целевого сервера.
//
// Возвращаемое значение:
//	Число - 502
//
Функция BadGateway_502() Экспорт
	Возврат 502;
КонецФункции

// 503 Service Unavailable
// Сервер не готов обработать запрос в данный момент.
// Распространенными причинами являются техническое обслуживание или перегрузка сервера.
// Вместе с таким ответом следует отправлять удобную для пользователя страницу с объяснением проблемы,
// а также HTTP-заголовок Retry-After с расчетным временем решения проблемы.
// Кроме того, полезно отправлять заголовки с информацией о кешировании,
// поскольку эти временные ответы обычно не следует кэшировать.
//
// Возвращаемое значение:
//	Число - 503
//
Функция ServiceUnavailable_503() Экспорт
	Возврат 503;
КонецФункции

// 504 Gateway Timeout
// Такой ответ может прислать сервер, который выступает в качестве шлюза,
// если в процессе обработки запроса он не может вовремя получить ответ от целевого сервера.
//
// Возвращаемое значение:
//	Число - 504
//
Функция GatewayTimeout_504() Экспорт
	Возврат 504;
КонецФункции

// 505 HTTP Version Not Supported
// Используемая в запросе версия HTTP не поддерживается сервером.
//
// Возвращаемое значение:
//	Число - 505
//
Функция HTTPVersionNotSupported_505() Экспорт
	Возврат 505;
КонецФункции

// 506 Variant Also Negotiates
// На сервере произошла внутренняя ошибка конфигурации:
// выбранный в процессе согласования вариант ресурса не является подходящим.
//
// Возвращаемое значение:
//	Число - 506
//
Функция VariantAlsoNegotiates_506() Экспорт
	Возврат 506;
КонецФункции

// 507 Insufficient Storage (WebDAV)
// Запрос не выполнен, потому что серверу не удалось сохранить данные.
//
// Возвращаемое значение:
//	Число - 507
//
Функция InsufficientStorage_507() Экспорт
	Возврат 507;
КонецФункции

// 508 Loop Detected (WebDAV)
// Запрос не выполнен, потому что на сервере был обнаружен бесконечный цикл обработки данных.
//
// Возвращаемое значение:
//	Число - 508
//
Функция LoopDetected_508() Экспорт
	Возврат 508;
КонецФункции

// 510 Not Extended
// Для выполнения запроса необходимо его расширить.
//
// Возвращаемое значение:
//	Число - 510
//
Функция NotExtended_510() Экспорт
	Возврат 510;
КонецФункции

// 511 Network Authentication Required
// Клиенту необходимо пройти аутентификацию для получения доступа к сети.
//
// Возвращаемое значение:
//	Число - 511
//
Функция NetworkAuthenticationRequired_511() Экспорт
	Возврат 511;
КонецФункции

#КонецОбласти

#КонецОбласти
